:PROPERTIES:
:ID:       7c990485-430a-467a-bc6b-ed2fdd7dc4dc
:END:
#+TITLE: Terminal
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: notes

**** Security

Via [[https://www.reddit.com/r/selfhosted/comments/1bbw6ta/comment/kuh6ci3/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button][this reddit post]], RHEL deprecated Screen as "hard to maintain & validate"
and the notice that specifically mentions that =tmux= satisfies the stringent
requirements for use in secure environments.

The =tmux= you'd run in a secure environment will not include many or even most of
the functionality listed in [[https://github.com/rothgar/awesome-tmux][rothgar/awesome-tmux]]

+ this [[https://www.hackingarticles.in/linux-for-pentester-tmux-privilege-escalation/][tmux priviledge esc.]] is a nothing burger...

However, I'm cynical. =screen= is just simpler (no plugins, etc)

+ Screen AFAIK has no plugins +(it's basically a superset of Bash, though that
  may not be a faithful representation, conceptually...)+
+ Screen does not have the same kind of DSL and does not (beyond the limited set
  of functions available within a SINGLE manual).
+ Validating a Screen config is far simpler.

#+begin_src sh
find ~/src/screen/src -type f -name "*.c" -exec wc -l \{\} +
#+end_src

#+RESULTS:
|   868 | /home/dc/src/screen/src/acls.c                  |
|  2372 | /home/dc/src/screen/src/ansi.c                  |
|   525 | /home/dc/src/screen/src/attacher.c              |
|   208 | /home/dc/src/screen/src/backtick.c              |
|   787 | /home/dc/src/screen/src/canvas.c                |
|   231 | /home/dc/src/screen/src/comm.c                  |
|  3071 | /home/dc/src/screen/src/display.c               |
|  1578 | /home/dc/src/screen/src/encoding.c              |
|   629 | /home/dc/src/screen/src/fileio.c                |
|   593 | /home/dc/src/screen/src/help.c                  |
|   440 | /home/dc/src/screen/src/input.c                 |
|  1058 | /home/dc/src/screen/src/layer.c                 |
|   354 | /home/dc/src/screen/src/layout.c                |
|   228 | /home/dc/src/screen/src/list_display.c          |
|   441 | /home/dc/src/screen/src/list_generic.c          |
|   227 | /home/dc/src/screen/src/list_license.c          |
|   621 | /home/dc/src/screen/src/list_window.c           |
|   235 | /home/dc/src/screen/src/logfile.c               |
|  1269 | /home/dc/src/screen/src/mark.c                  |
|   240 | /home/dc/src/screen/src/misc.c                  |
|  7419 | /home/dc/src/screen/src/process.c               |
|    77 | /home/dc/src/screen/src/pty.c                   |
|   822 | /home/dc/src/screen/src/resize.c                |
|   215 | /home/dc/src/screen/src/sched.c                 |
|  1926 | /home/dc/src/screen/src/screen.c                |
|   347 | /home/dc/src/screen/src/search.c                |
|  1458 | /home/dc/src/screen/src/socket.c                |
|   480 | /home/dc/src/screen/src/telnet.c                |
|   302 | /home/dc/src/screen/src/term.c                  |
|  1200 | /home/dc/src/screen/src/termcap.c               |
|   204 | /home/dc/src/screen/src/terminfo/checktc.c      |
|    20 | /home/dc/src/screen/src/terminfo/tetris.c       |
|    62 | /home/dc/src/screen/src/tests/mallocmock.c      |
|   397 | /home/dc/src/screen/src/tests/test-winmsgbuf.c  |
|   174 | /home/dc/src/screen/src/tests/test-winmsgcond.c |
|  1260 | /home/dc/src/screen/src/tty.c                   |
|   404 | /home/dc/src/screen/src/utmp.c                  |
|    77 | /home/dc/src/screen/src/viewport.c              |
|  2012 | /home/dc/src/screen/src/window.c                |
|   964 | /home/dc/src/screen/src/winmsg.c                |
|   322 | /home/dc/src/screen/src/winmsgbuf.c             |
|   127 | /home/dc/src/screen/src/winmsgcond.c            |
| 36244 | total                                           |
